# Pandas tutorial

In [2]:
import pandas as pd
import numpy as np

In [3]:
print(pd.__version__)

0.25.1

# Series create, manipulate, querry, delete

In [4]:
# create series from list
arr = [0,1,2,3,4]
s1 = pd.Series(arr) #prints array with indexes
s1

0    0
1    1
2    2
3    3
4    4
dtype: int64

In [6]:
order = [1,2,3,4,5]
s2 = pd.Series(arr, index=order) # changes indexes to 1,2,3,4,5
s2

1    0
2    1
3    2
4    3
5    4
dtype: int64

In [38]:

n = np.random.randn(5) # create an array of random numbers
index = ['a', 'b', 'c', 'd', 'e']
arr = pd.Series(n, index = index)
arr

a    1.190526
b    1.103363
c   -0.084538
d    0.462729
e    0.795998
dtype: float64

In [11]:
#create series from dictionary
d = {'a':1, 'b':2,'c':3, 'd':4, 'e': 5}
s3 = pd.Series(d)
s3

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [21]:
#modify index of series
s1.index = ['A','B', 'C', 'D', 'E']
s1

A    0
B    1
C    2
D    3
E    4
dtype: int64

In [17]:
#slicing
a=s1[:1] #print from beginning to index
print(a)
b=s1[1:]
print(b) #prints from index to index

a    0
dtype: int64
b    1
c    2
d    3
e    4
dtype: int64

In [22]:
s4 = s1.append(s3) #add one series to the end of the other
s4

A    0
B    1
C    2
D    3
E    4
a    1
b    2
c    3
d    4
e    5
dtype: int64

In [29]:
# dropsees = ['b', 'B']# able to drop multiple in series if put in an array
s4.drop(dropsees)
s4.drop('c')

A    0
B    1
C    2
D    3
E    4
a    1
b    2
d    4
e    5
dtype: int64

In [30]:
arr1 = [0,1,2,3,4,5,7]
arr2 = [6,7,8,9,5]

In [31]:
s5 = pd.Series(arr2)
s6 = pd.Series(arr1)

In [32]:
s5.add(s6)

0     6.0
1     8.0
2    10.0
3    12.0
4     9.0
5     NaN
6     NaN
dtype: float64

In [33]:
print("s6 median", s6.median())
print("s6 max", s6.max())
print("s6 min", s6.min())

s6 median 3.0
s6 max 7
s6 min 0

# Create data frome

In [5]:
dates = pd.date_range("today", periods = 6) #prints 6days including today
num_arr = np.random.randn(6,4) #prints 6 arrays with 4 numbers in each of random number 6rows 4 columns
columns = ["A", 'B', "C", "D"] #sets column name
df1 = pd.DataFrame(num_arr,index = dates, columns = columns)
df1

                                   A         B         C         D
2020-05-03 12:44:55.080612  0.007126 -1.269980  2.779810 -1.168371
2020-05-04 12:44:55.080612  1.189799 -0.605751 -0.254237 -0.806810
2020-05-05 12:44:55.080612 -0.876072  0.775429  0.186758  0.527941
2020-05-06 12:44:55.080612  1.515166  0.332614 -0.150697 -0.803840
2020-05-07 12:44:55.080612  0.635553  0.825318  0.558074 -0.803285
2020-05-08 12:44:55.080612  1.609224 -0.922728 -0.566939 -0.376748

In [6]:
print("prints top",df1.head(1))
print("prints bottom", df1.tail(1))

prints top                                    A        B        C         D
2020-05-03 12:44:55.080612  0.007126 -1.26998  2.77981 -1.168371
prints bottom                                    A         B         C         D
2020-05-08 12:44:55.080612  1.609224 -0.922728 -0.566939 -0.376748

In [7]:
df1.values #prints number data without column labels or indexes unless data is a dictionary will pull property name

array([[ 0.00712596, -1.26997964,  2.77981043, -1.16837147],
       [ 1.18979897, -0.60575079, -0.25423683, -0.80680995],
       [-0.87607171,  0.77542924,  0.18675839,  0.52794117],
       [ 1.51516605,  0.33261436, -0.15069734, -0.80384041],
       [ 0.63555282,  0.82531826,  0.55807385, -0.80328549],
       [ 1.60922429, -0.92272763, -0.56693942, -0.3767481 ]])

In [8]:
df1.describe() #gives statistical data of dataframe

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.680133 -0.144183  0.425462 -0.571852
std    0.969221  0.905489  1.216251  0.594312
min   -0.876072 -1.269980 -0.566939 -1.168371
25%    0.164233 -0.843483 -0.228352 -0.806068
50%    0.912676 -0.136568  0.018031 -0.803563
75%    1.433824  0.664726  0.465245 -0.483382
max    1.609224  0.825318  2.779810  0.527941

In [9]:
df1.T

,2020-05-03 12:44:55.080612,2020-05-04 12:44:55.080612,2020-05-05 12:44:55.080612,2020-05-06 12:44:55.080612,2020-05-07 12:44:55.080612,2020-05-08 12:44:55.080612
A,0.007126,1.189799,-0.876072,1.515166,0.635553,1.609224
B,-1.269980,-0.605751,0.775429,0.332614,0.825318,-0.922728
C,2.779810,-0.254237,0.186758,-0.150697,0.558074,-0.566939
D,-1.168371,-0.806810,0.527941,-0.803840,-0.803285,-0.376748

In [11]:
d = {'animal':['cat', 'dog','snake', 'turtle'],
     'age':[4,2,1,3], 
     'visits':[9,8,7,6],
     'priority':['yes','no','no','yes']}
labels = ['A', 'B', 'C', 'D']
df2 = pd.DataFrame(d, index = labels)
df2

   animal  age  visits priority
A     cat    4       9      yes
B     dog    2       8       no
C   snake    1       7       no
D  turtle    3       6      yes

In [14]:
df2.dtypes #print data types

animal      object
age          int64
visits       int64
priority    object
dtype: object

In [17]:
df2.head(2) #prints by index + 1

  animal  age  visits priority
A    cat    4       9      yes
B    dog    2       8       no

In [18]:
df2.tail(1) #prints end of data

   animal  age  visits priority
D  turtle    3       6      yes

In [19]:
df2.index #prints index of data frame

Index(['A', 'B', 'C', 'D'], dtype='object')

In [21]:
df2.columns #prints column names without data types

Index(['animal', 'age', 'visits', 'priority'], dtype='object')

In [56]:
df2.sort_values(by='age')

   animal  age  visits priority
C   snake    1       7       no
B     dog    2       8       no
D  turtle    3       6      yes
A     cat    4       9      yes

In [57]:
df2[['age','visits']]#query by tag

   age  visits
A    4       9
B    2       8
C    1       7
D    3       6

In [22]:
df2.describe() #prints summary of data

            age    visits
count  4.000000  4.000000
mean   2.500000  7.500000
std    1.290994  1.290994
min    1.000000  6.000000
25%    1.750000  6.750000
50%    2.500000  7.500000
75%    3.250000  8.250000
max    4.000000  9.000000

In [24]:
df2.T #flips columns and rows

            A    B      C       D
animal    cat  dog  snake  turtle
age         4    2      1       3
visits      9    8      7       6
priority  yes   no     no     yes

In [28]:
df2[1:3] #prints sliced dataframe

  animal  age  visits priority
B    dog    2       8       no
C  snake    1       7       no

In [30]:
df2.sort_values(by="age")[1:3] 
#prints sliced dataframe sorted by age

   animal  age  visits priority
B     dog    2       8       no
D  turtle    3       6      yes

In [32]:
df2.iloc[1:3] #query by row

  animal  age  visits priority
B    dog    2       8       no
C  snake    1       7       no

In [33]:
df2.isnull()

   animal    age  visits  priority
A   False  False   False     False
B   False  False   False     False
C   False  False   False     False
D   False  False   False     False

In [37]:
df2.loc["f","age"]=10 
#change value of age in row f to 10
#adds value to dataframe if it doesn't exist
df2

   animal   age  visits priority
A     cat   4.0     9.0      yes
B     dog   2.0     8.0       no
C   snake   1.0     7.0       no
D  turtle   3.0     6.0      yes
f     NaN  10.0     NaN      NaN

In [38]:
df2.mean()

age       4.0
visits    7.5
dtype: float64

In [39]:
df2['visits'].sum()

30.0